# Data Replace

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Replace data.csv")
df

      Name   Age   Salary    JoinDate Department
0    Alice  25.0  50000.0   1/15/2020         HR
1      Bob   NaN  60000.0   7/23/2019    Finance
2  Charlie  30.0      NaN         NaN         IT
3    David  22.0  45000.0    3/1/2021        NaN
4  maxwell  28.0  52000.0  11/11/2018  Marketing

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Age         4 non-null      float64
 2   Salary      4 non-null      float64
 3   JoinDate    4 non-null      object
 4   Department  4 non-null      object
dtypes: float64(2), object(3)
memory usage: 328.0+ bytes

In [3]:
df.isnull().sum()

Name          0
Age           1
Salary        1
JoinDate      1
Department    1
dtype: int64

In [7]:
df['Department'].value_counts()

Department
HR           1
Finance      1
IT           1
Marketing    1
Name: count, dtype: int64

In [9]:
# fill null
df['Department'].fillna(df["Department"].mode()[0],inplace=True)
df

      Name   Age   Salary    JoinDate Department
0    Alice  25.0  50000.0   1/15/2020         HR
1      Bob   NaN  60000.0   7/23/2019    Finance
2  Charlie  30.0      NaN         NaN         IT
3    David  22.0  45000.0    3/1/2021    Finance
4  maxwell  28.0  52000.0  11/11/2018  Marketing

In [11]:
df['Department'].replace('Marketing','IT',inplace=True)
df

      Name   Age   Salary    JoinDate Department
0    Alice  25.0  50000.0   1/15/2020         HR
1      Bob   NaN  60000.0   7/23/2019    Finance
2  Charlie  30.0      NaN         NaN         IT
3    David  22.0  45000.0    3/1/2021    Finance
4  maxwell  28.0  52000.0  11/11/2018         IT

# Change data type

In [15]:
df['Department'] = df['Department'].astype('string')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Age         4 non-null      float64
 2   Salary      4 non-null      float64
 3   JoinDate    4 non-null      object
 4   Department  5 non-null      string
dtypes: float64(2), object(2), string(1)
memory usage: 328.0+ bytes